INSERT INTO defects VALUES
(1, 'Дефект: Нет экструдирования при начале печати', 'Описание: 3D принтер не печатает', 'Причины:
•	отсутствие пластика в сопле,
•	засор отверстия сопла,
•	сопло располагается вплотную к рабочей поверхности ,
•	шестерня для подачи филамента прокручивается.
', 'Как бороться
•	Убедитесь, что вы подготовили экструдер таким образом, чтобы сопло было заполнено пластиком и готово к экструдированию. Стандартный прием состоит в том, чтобы напечатать так называемую «юбку» (skirt). Эта «юбка» — кольцо, обводка, контур вокруг вашей будущей детали, и пока оно печатается, экструдер заполняется пластиком.
•	Прочистить сопло можно механически, для этого многие магазины предлагают специальные иглы и сверла для прочистки сопла экструдера, так же рекомендуем воспользоваться методом холодной протяжки. Последняя мера, если ничего не помогает, проблема с забившимся экструдером решается путем его разборки, и перед тем, как взяться за это дело, полезно связаться с производителем или продавцом вашего принтера. Сопло и термобарьер можно погрузить в растворитель, тем самым химически прочистить налипший пластик, затем механически вычестить из него весь нагар.
', 'src\\main\\java\\com\\example\\backend_defects\\image\\paris.jpg');
